Content:
Used Cars Prices

Here you find 78612 records about used cars:
<br>
60 Brand, 382 Model, 33 Modelyear,
<br>
1839 CarModel, 1397 AveragePrice,
<br>
893 MinimumPrice, 916 MaximumPrice,
<br>
over 128 Months/Year.

### Some Questions you should ask yourself about.
1.  Is there any duplicates? .
2. What about the nulls?.
3. Does all columns has the a correct format in its values? if its not how should you make it better?
4. Datatypes?
5. Before starting , after seeing some info about the dataset and from the first look on the dataset , what columns you think will not be necessary in our dataset? (io: what columns you think dropping it will be better?).
<br>
<br>
feel free to wirte only their names in the next cell

Double Click here to start writing

In [1]:
#import Libraries (numpy & Pandas)
import pandas as pd
import numpy as np

In [2]:
#read Data
Data=pd.read_csv('./used_car_prices.csv')

In [3]:
#print the first 8 row
Data.head(8)

,web-scraper-order,Car Model,Month/Year,Average price,Minimum price,Maximum price
0,1680204632-1,Skoda Octavia A8 2022,2023-03,"967,000 EGP","926,000 EGP","1,017,000 EGP"
1,1680204632-2,Skoda Octavia A8 2022,2023-02,"979,000 EGP","931,000 EGP","1,045,000 EGP"
2,1680204632-3,Skoda Octavia A8 2022,2023-01,"917,000 EGP","893,000 EGP","950,000 EGP"
3,1680204632-4,Skoda Octavia A8 2022,2022-12,"881,000 EGP","793,000 EGP","950,000 EGP"
4,1680204632-5,Skoda Octavia A8 2022,2022-11,"868,000 EGP","789,000 EGP","950,000 EGP"
5,1680204632-6,Skoda Octavia A8 2022,2022-10,"797,000 EGP","789,000 EGP","808,000 EGP"
6,1680204632-7,Skoda Octavia A8 2022,2022-09,"837,000 EGP","770,000 EGP","874,000 EGP"
7,1680204632-8,Skoda Octavia A8 2022,2022-08,"779,000 EGP","722,000 EGP","855,000 EGP"

In [4]:
#print the shape Like (There are 84548 rows and 22 columns)
Data.shape

(79090, 6)

In [5]:
# try seeing some information about the data
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79090 entries, 0 to 79089
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   web-scraper-order  79090 non-null  object
 1   Car Model          79090 non-null  object
 2   Month/Year         78612 non-null  object
 3   Average price      78612 non-null  object
 4   Minimum price      78612 non-null  object
 5   Maximum price      78612 non-null  object
dtypes: object(6)
memory usage: 3.6+ MB

In [6]:
# show the number of duplicates here
Data.duplicated().sum()

0

In [7]:
# show number of nulls
Data.isna().sum()

web-scraper-order      0
Car Model              0
Month/Year           478
Average price        478
Minimum price        478
Maximum price        478
dtype: int64

In [8]:
# updated the column names Like(To Start with Upper Litter)
def Capitalize(ColumnName):
    return ColumnName.title()

Data.columns = map(Capitalize, Data.columns)
Data.head(2)

,Web-Scraper-Order,Car Model,Month/Year,Average Price,Minimum Price,Maximum Price
0,1680204632-1,Skoda Octavia A8 2022,2023-03,"967,000 EGP","926,000 EGP","1,017,000 EGP"
1,1680204632-2,Skoda Octavia A8 2022,2023-02,"979,000 EGP","931,000 EGP","1,045,000 EGP"

In [9]:
# Split Car Full Data into Brand, Model, And Year of The Model
Data[['Brand', 'Model1', 'Model2', 'YearOfModel']]=Data['Car Model'].str.split(n=3 ,expand=True)
Data['Model'] = Data['Model1'] + ' ' + Data['Model2']
Data = Data.drop(['Car Model', 'Model1', 'Model2'], axis=1)# Drop The Old Columns
Data = Data.drop('Web-Scraper-Order', axis=1) # Drop Id Column

Data.head(2)

,Month/Year,Average Price,Minimum Price,Maximum Price,Brand,YearOfModel,Model
0,2023-03,"967,000 EGP","926,000 EGP","1,017,000 EGP",Skoda,2022,Octavia A8
1,2023-02,"979,000 EGP","931,000 EGP","1,045,000 EGP",Skoda,2022,Octavia A8

In [10]:
import pandas as pd

# Assuming Data is your DataFrame
Data['Average Price'] = pd.to_numeric(Data['Average Price'].str.replace('[^\d.]', '', regex=True), errors='coerce')
Data['Minimum Price'] = pd.to_numeric(Data['Minimum Price'].str.replace('[^\d.]', '', regex=True), errors='coerce')
Data['Maximum Price'] = pd.to_numeric(Data['Maximum Price'].str.replace('[^\d.]', '', regex=True), errors='coerce')

In [11]:
Data.head(2)

,Month/Year,Average Price,Minimum Price,Maximum Price,Brand,YearOfModel,Model
0,2023-03,967000.0,926000.0,1017000.0,Skoda,2022,Octavia A8
1,2023-02,979000.0,931000.0,1045000.0,Skoda,2022,Octavia A8

In [12]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79090 entries, 0 to 79089
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Month/Year     78612 non-null  object
 1   Average Price  78612 non-null  float64
 2   Minimum Price  78612 non-null  float64
 3   Maximum Price  78612 non-null  float64
 4   Brand          79090 non-null  object
 5   YearOfModel    10080 non-null  object
 6   Model          79090 non-null  object
dtypes: float64(3), object(4)
memory usage: 4.2+ MB

In [13]:
# Split Month/Year Column to Year and Month 
Data[['Year', 'Month']] = Data['Month/Year'].str.split('-', expand=True)
Data = Data.drop('Month/Year', axis=True)

In [14]:
Data.head()

,Average Price,Minimum Price,Maximum Price,Brand,YearOfModel,Model,Year,Month
0,967000.0,926000.0,1017000.0,Skoda,2022,Octavia A8,2023,03
1,979000.0,931000.0,1045000.0,Skoda,2022,Octavia A8,2023,02
2,917000.0,893000.0,950000.0,Skoda,2022,Octavia A8,2023,01
3,881000.0,793000.0,950000.0,Skoda,2022,Octavia A8,2022,12
4,868000.0,789000.0,950000.0,Skoda,2022,Octavia A8,2022,11

In [15]:
# let's start with (Average price ,Minimum price ,Maximum price ) , see the number of nulls in them , replace these nulls with the ( mean , median and mode) of these columns
#and in the end check that there are not nulls in data 
mean_value   = Data['Average Price'].mean()
median_value = Data['Minimum Price'].median()
mode_value   = Data['Maximum Price'].mode().iloc[0]

Data['Average Price'].fillna(mean_value  , inplace=True)
Data['Minimum Price'].fillna(median_value, inplace=True)
Data['Maximum Price'].fillna(mode_value  , inplace=True)

In [16]:
Data[['Average Price', 'Minimum Price', 'Maximum Price']].isna().sum()

Average Price    0
Minimum Price    0
Maximum Price    0
dtype: int64

# Thanks